#1. Задание

name = input('Введите имя: ')
print('Привет, ', name + '!')

#2. Задание
name = input('Введите имя: ')
print('Привет, ', name + '!')
name2 = input('Введите второе имя: ')
print('Привет, ', name2 + '!')

#3. Задание
sur_name = input('Введите фамилию: ')
print('Ваша фамилия - ', sur_name)
