print('Задание 1.')

# Исправьте программу так, чтобы в результате её
# выполнения на экран вывелась «доска».
# Пример:
# ----------
# |00000000|
# |00000000|
# |00000000|
# |00000000|
# ----------



print('----------')
print('|00000000|')
print('|00000000|')
print('|00000000|')
print('|00000000|')
print('----------')


#Напишите программу, которая выводит такое «окно» на экран.

#Первый вариант
# ==============================
# Привет
# друг
# ==============================

# Второй вариант
# ==============================
# ||        Привет            ||
# ||         друг             ||
# ==============================

#Третий вариант
# ==============================
# ||                          ||
# ||                          ||
# ||          Привет,         ||
# ||          друг!           ||
# ||                          ||
# ||                          ||
# ==============================

#Размер окна может быть любым,
#вместо слова «друг» можете написать своё имя.
#Постарайтесь добиться результата из третьего варианта.
print('Задание 2.')

print('='*14)
print('||  Привет, ||')
print('||   Друг   ||')
print('='*14)

print('='*18)
print('||              ||')
print('||              ||')
print('||    Привет,   ||')
print('||     Друг     ||')
print('||              ||')
print('||              ||')
print('='*18)